{
  "help": "Welcome to AlgoBot, an RC community tool designed to provide daily DS&A questions and mock interviews!\nTake a look at [the README](https://github.com/cdkini/AlgoBot/blob/master/README.md) for a more detailed overview.\n\n **How to use AlgoBot:**\n* `subscribe` to start getting daily data structures and algorithms questions. Oh how fun!\n* `schedule` to add yourself to the queue for a mock interview!\n  * You'll remain in the queue until you get a match! Upon interviewing, you'll need to `schedule` once again.\n  * In the case you no longer can mock interview, please `cancel`.\n * `skip` to skip tomorrow's daily question.\n * `unskip` to undo skipping tomorrow.\n* `config` to review and modify your current settings\n* `unsubscribe` to part ways with AlgoBot. Note that your settings and session history will be deleted!\n\nIf you've found a bug, please PM @**Chetan Kini (he) (W2'21)** or [submit an issue on github](https://github.com/cdkini/recurse-mock-interview-bot/issues).",
  "subscribe": "Yay! You're now subscribed to AlgoBot!\n\nWe've picked some sensible defaults for you configuration but please go ahead and make tweaks with `config`!\nCurrently, I'm planning to send you questions on **Mondays**, **Tuesdays**, **Wednesdays**, **Thursdays**, and **Fridays**.\n\nAdditionally, you can `schedule` mock interviews or visit the daily thread on #**Daily LeetCode** for some more practice.\n\nThanks for signing up :)",
  "unsubscribe": "You're unsubscribed!\nYou'll no longer be messaged about DS&A questions or mock interviews.\n\nBe well :)",
  "notSubscribed": "You're not subscribed to AlgoBot!",
  "notConfigured": "You have yet to set your configuration (use `config`)",
  "notMatched": "Ah I'm afraid I couldn't find you a match today!\n\nYou may have been the odd person out or I just couldn't find someone that matched your configuration.\nI've kept you in the pool for tomorrow so fingers crossed I resolve this then.\n\nThank you for your patience :)",
  "matched": "Hi you two! You've been matched for a mock interview :)\n\nI've separately messaged each of you about the question you should prepare as the interviewer.\n If this is your first time using AlgoBot for mock interviews, please read over the README.\n\n Best of luck and have fun!",
  "writeError": "Something went sideways while writing to the database. You should probably ping `@**Chetan Kini (he) (W2'21)**`",
  "readError": "Something went sideways while reading from the database. You should probably ping `@**Chetan Kini (he) (W2'21)**`"
}
